In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(list('abcdef'))
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [3]:
t = pd.Series([2, 4, 6, 8])
t

0    2
1    4
2    6
3    8
dtype: int64

In [4]:
s = pd.Series([2, 4, 6, 8], index = ['f', 'a', 'c', 'e'])

In [5]:
s['a']

4

In [6]:
s[['a', 'c']]

a    4
c    6
dtype: int64

In [7]:
s2 = pd.Series(range(4), index= list('abab'))

In [8]:
s2

a    0
b    1
a    2
b    3
dtype: int64

In [9]:
s['a']

4

In [10]:
s2['a']

a    0
a    2
dtype: int64

In [11]:
s[s>4]

c    6
e    8
dtype: int64

In [12]:
s>4

f    False
a    False
c     True
e     True
dtype: bool

In [13]:
s*2

f     4
a     8
c    12
e    16
dtype: int64

In [14]:
sdata = {'b': 100, 'c': 150, 'd': 200}

In [15]:
s = pd.Series(sdata)
s

b    100
c    150
d    200
dtype: int64

In [16]:
s = pd.Series(sdata, list('abcd'))
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [17]:
s2 = pd.Series([1, 2, 3], index = ['c', 'b', 'a'])
s2

c    1
b    2
a    3
dtype: int64

In [18]:
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [19]:
s*s2

a      NaN
b    200.0
c    150.0
d      NaN
dtype: float64

In [20]:
data = {'state': ['FL', 'FL', 'GA', 'GA', 'GA'],
        'year': [2010, 2011, 2008, 2010, 2011],
        'pop': [18.8, 19.1, 9.7, 9.7, 9.8]}

In [21]:
frame = pd.DataFrame(data)

In [22]:
frame

    pop state  year
0  18.8    FL  2010
1  19.1    FL  2011
2   9.7    GA  2008
3   9.7    GA  2010
4   9.8    GA  2011

In [23]:
frame.columns

Index(['pop', 'state', 'year'], dtype='object')

In [24]:
frame.columns = ['state', 'year', 'pop']

In [25]:
frame

   state year   pop
0   18.8   FL  2010
1   19.1   FL  2011
2    9.7   GA  2008
3    9.7   GA  2010
4    9.8   GA  2011

In [23]:
pop_data = {'FL': {2010: 18.8, 2011: 19.1},
            'GA': {2008: 9.7, 2010: 9.7, 2011: 9.8}}

In [24]:
pop = pd.DataFrame(pop_data)

In [25]:
pop

        FL   GA
2008   NaN  9.7
2010  18.8  9.7
2011  19.1  9.8

In [26]:
frame['state']

0    FL
1    FL
2    GA
3    GA
4    GA
Name: state, dtype: object

In [27]:
pop.iloc[0]

FL    NaN
GA    9.7
Name: 2008, dtype: float64

In [28]:
pop.loc[2010]

FL    18.8
GA     9.7
Name: 2010, dtype: float64

In [29]:
frame['other'] = np.nan
frame

    pop state  year  other
0  18.8    FL  2010    NaN
1  19.1    FL  2011    NaN
2   9.7    GA  2008    NaN
3   9.7    GA  2010    NaN
4   9.8    GA  2011    NaN

In [30]:
frame['calc'] = frame['pop'] * 2
frame

    pop state  year  other  calc
0  18.8    FL  2010    NaN  37.6
1  19.1    FL  2011    NaN  38.2
2   9.7    GA  2008    NaN  19.4
3   9.7    GA  2010    NaN  19.4
4   9.8    GA  2011    NaN  19.6

In [31]:
obj = pd.Series(['blue', 'purple', 'red'], index=[0, 2, 4])
obj

0      blue
2    purple
4       red
dtype: object

In [32]:
obj.reindex(range(4))

0      blue
1       NaN
2    purple
3       NaN
dtype: object

In [33]:
obj.reindex(range(5), fill_value='black')

0      blue
1     black
2    purple
3     black
4       red
dtype: object

In [34]:
obj.reindex(range(5), method='ffill')

0      blue
1      blue
2    purple
3    purple
4       red
dtype: object

In [35]:
obj.reindex(range(5), method='bfill')

0      blue
1    purple
2    purple
3       red
4       red
dtype: object

In [36]:
obj.reindex(range(5), method='nearest')

0      blue
1    purple
2    purple
3       red
4       red
dtype: object

In [37]:
pop.sum()

FL    37.9
GA    29.2
dtype: float64

In [38]:
pop.mean()

FL    18.950000
GA     9.733333
dtype: float64

In [39]:
pop.describe()

              FL        GA
count   2.000000  3.000000
mean   18.950000  9.733333
std     0.212132  0.057735
min    18.800000  9.700000
25%    18.875000  9.700000
50%    18.950000  9.700000
75%    19.025000  9.750000
max    19.100000  9.800000

In [28]:
pop_data={'FL':{2010:18.8,2011:19.1},
          'GA':{2008:9.7,2010:9.7,2011:9.8}}
pop=pd.DataFrame(pop_data)
pop

        FL   GA
2008   NaN  9.7
2010  18.8  9.7
2011  19.1  9.8

In [29]:
pop

        FL   GA
2008   NaN  9.7
2010  18.8  9.7
2011  19.1  9.8

In [30]:
pop < 9.8

         FL     GA
2008  False   True
2010  False   True
2011  False  False

In [41]:
pop[pop < 9.8] = 0
pop

        FL   GA
2008   NaN  0.0
2010  18.8  0.0
2011  19.1  9.8

In [32]:
mpg = pd.read_csv('http://bit.ly/2jjoxjk')

In [33]:
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190,3850,8.5,70,1,amc ambassador dpl
10,15.0,8,383.0,170,3563,10.0,70,1,dodge challenger se
11,14.0,8,340.0,160,3609,8.0,70,1,plymouth 'cuda 340
12,15.0,8,400.0,150,3761,9.5,70,1,chevrolet monte carlo
13,14.0,8,455.0,225,3086,10.0,70,1,buick estate wagon (sw)
14,24.0,4,113.0,95,2372,15.0,70,3,toyota corona mark ii
15,22.0,6,198.0,95,2833,15.5,70,1,plymouth duster
16,18.0,6,199.0,97,2774,15.5,70,1,amc hornet
17,21.0,6,200.0,85,2587,16.0,70,1,ford maverick
18,27.0,4,97.0,88,2130,14.5,70,3,datsun pl510
19,26.0,4,97.0,46,1835,20.5,70,2,volkswagen 1131 deluxe sedan
20,25.0,4,110.0,87,2672,17.5,70,2,peugeot 504
21,24.0,4,107.0,90,2430,14.5,70,2,audi 100 ls
22,25.0,4,104.0,95,2375,17.5,70,2,saab 99e
23,26.0,4,121.0,113,2234,12.5,70,2,bmw 2002
24,21.0,6,199.0,90,2648,15.0,70,1,amc gremlin
25,10.0,8,360.0,215,4615,14.0,70,1,ford f250
26,10.0,8,307.0,200,4376,15.0,70,1,chevy c20
27,11.0,8,318.0,210,4382,13.5,70,1,dodge d200
28,9.0,8,304.0,193,4732,18.5,70,1,hi 1200d
29,27.0,4,97.0,88,2130,14.5,71,3,datsun pl510
...,...,...,...,...,...,...,...,...,...
368,27.0,4,112.0,88,2640,18.6,82,1,chevrolet cavalier wagon
369,34.0,4,112.0,88,2395,18.0,82,1,chevrolet cavalier 2-door
370,31.0,4,112.0,85,2575,16.2,82,1,pontiac j2000 se hatchback
371,29.0,4,135.0,84,2525,16.0,82,1,dodge aries se
372,27.0,4,151.0,90,2735,18.0,82,1,pontiac phoenix
373,24.0,4,140.0,92,2865,16.4,82,1,ford fairmont futura
374,23.0,4,151.0,?,3035,20.5,82,1,amc concord dl
375,36.0,4,105.0,74,1980,15.3,82,2,volkswagen rabbit l
376,37.0,4,91.0,68,2025,18.2,82,3,mazda glc custom l
377,31.0,4,91.0,68,1970,17.6,82,3,mazda glc custom
378,38.0,4,105.0,63,2125,14.7,82,1,plymouth horizon miser
379,36.0,4,98.0,70,2125,17.3,82,1,mercury lynx l
380,36.0,4,120.0,88,2160,14.5,82,3,nissan stanza xe
381,36.0,4,107.0,75,2205,14.5,82,3,honda accord
382,34.0,4,108.0,70,2245,16.9,82,3,toyota corolla
383,38.0,4,91.0,67,1965,15.0,82,3,honda civic
384,32.0,4,91.0,67,1965,15.7,82,3,honda civic (auto)
385,38.0,4,91.0,67,1995,16.2,82,3,datsun 310 gx
386,25.0,6,181.0,110,2945,16.4,82,1,buick century limited
387,38.0,6,262.0,85,3015,17.0,82,1,oldsmobile cutlass ciera (diesel)
388,26.0,4,156.0,92,2585,14.5,82,1,chrysler lebaron medallion
389,22.0,6,232.0,112,2835,14.7,82,1,ford granada l
390,32.0,4,144.0,96,2665,13.9,82,3,toyota celica gt
391,36.0,4,135.0,84,2370,13.0,82,1,dodge charger 2.2
392,27.0,4,151.0,90,2950,17.3,82,1,chevrolet camaro
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [34]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [35]:
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [36]:
mpg.min()

mpg                                   9
cylinders                             3
displacement                         68
horsepower                          100
weight                             1613
acceleration                          8
model_year                           70
origin                                1
name            amc ambassador brougham
dtype: object

In [37]:
mpg.max()

mpg                         46.6
cylinders                      8
displacement                 455
horsepower                     ?
weight                      5140
acceleration                24.8
model_year                    82
origin                         3
name            vw rabbit custom
dtype: object

In [38]:
mpg.groupby('model_year')['mpg'].max()

model_year
70    27.0
71    35.0
72    28.0
73    29.0
74    32.0
75    33.0
76    33.0
77    36.0
78    43.1
79    37.3
80    46.6
81    39.1
82    44.0
Name: mpg, dtype: float64

In [39]:
mpg.describe()

,mpg,cylinders,displacement,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [40]:
pd.pivot_table(mpg, values='mpg', index='model_year', columns='cylinders', aggfunc=min)

cylinders      3     4     5     6     8
model_year
70           NaN  24.0   NaN  18.0   9.0
71           NaN  22.0   NaN  16.0  12.0
72          19.0  18.0   NaN   NaN  11.0
73          18.0  19.0   NaN  16.0  11.0
74           NaN  24.0   NaN  15.0  13.0
75           NaN  22.0   NaN  15.0  13.0
76           NaN  19.0   NaN  16.5  13.0
77          21.5  21.5   NaN  17.5  15.0
78           NaN  21.1  20.3  16.2  17.5
79           NaN  22.3  25.4  19.8  15.5
80          23.7  23.6  36.4  19.1   NaN
81           NaN  25.8   NaN  17.6  26.6
82           NaN  23.0   NaN  22.0   NaN

In [42]:
mpg.model_year.unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [43]:
mpg.weight.unique()

array([3504, 3693, 3436, 3433, 3449, 4341, 4354, 4312, 4425, 3850, 3563,
       3609, 3761, 3086, 2372, 2833, 2774, 2587, 2130, 1835, 2672, 2430,
       2375, 2234, 2648, 4615, 4376, 4382, 4732, 2264, 2228, 2046, 2634,
       3439, 3329, 3302, 3288, 4209, 4464, 4154, 4096, 4955, 4746, 5140,
       2962, 2408, 3282, 3139, 2220, 2123, 2074, 2065, 1773, 1613, 1834,
       1955, 2278, 2126, 2254, 2226, 4274, 4385, 4135, 4129, 3672, 4633,
       4502, 4456, 4422, 2330, 3892, 4098, 4294, 4077, 2933, 2511, 2979,
       2189, 2395, 2288, 2506, 2164, 2100, 4100, 3988, 4042, 3777, 4952,
       4363, 4237, 4735, 4951, 3821, 3121, 3278, 2945, 3021, 2904, 1950,
       4997, 4906, 4654, 4499, 2789, 2279, 2401, 2379, 2124, 2310, 2472,
       2265, 4082, 4278, 1867, 2158, 2582, 2868, 3399, 2660, 2807, 3664,
       3102, 2875, 2901, 3336, 2451, 1836, 2542, 3781, 3632, 3613, 4141,
       4699, 4457, 4638, 4257, 2219, 1963, 2300, 1649, 2003, 2125, 2108,
       2246, 2489, 2391, 2000, 3264, 3459, 3432, 3158, 4668, 4440, 4498,
       4657, 3907, 3897, 3730, 3785, 3039, 3221, 3169, 2171, 2639, 2914,
       2592, 2702, 2223, 2545, 2984, 1937, 3211, 2694, 2957, 2671, 1795,
       2464, 2572, 2255, 2202, 4215, 4190, 3962, 3233, 3353, 3012, 3085,
       2035, 3651, 3574, 3645, 3193, 1825, 1990, 2155, 2565, 3150, 3940,
       3270, 2930, 3820, 4380, 4055, 3870, 3755, 2045, 1945, 3880, 4060,
       4140, 4295, 3520, 3425, 3630, 3525, 4220, 4165, 4325, 4335, 1940,
       2740, 2755, 2051, 2075, 1985, 2190, 2815, 2600, 2720, 1800, 2070,
       3365, 3735, 3570, 3535, 3155, 2965, 3430, 3210, 3380, 3070, 3620,
       3410, 3445, 3205, 4080, 2560, 2230, 2515, 2745, 2855, 2405, 2830,
       3140, 2795, 2135, 3245, 2990, 2890, 3265, 3360, 3840, 3725, 3955,
       3830, 4360, 4054, 3605, 1925, 1975, 1915, 2670, 3530, 3900, 3190,
       3420, 2200, 2150, 2020, 2595, 2700, 2556, 2144, 1968, 2120, 2019,
       2678, 2870, 3003, 3381, 2188, 2711, 2434, 2110, 2800, 2085, 2335,
       2950, 3250, 1850, 2145, 1845, 2910, 2420, 2500, 2905, 2290, 2490,
       2635, 2620, 2725, 2385, 1755, 1875, 1760, 2050, 2215, 2380, 2320,
       2210, 2350, 2615, 3230, 3160, 2900, 3415, 3060, 3465, 2605, 2640,
       2575, 2525, 2735, 2865, 3035, 1980, 2025, 1970, 2160, 2205, 2245,
       1965, 1995, 3015, 2585, 2835, 2665, 2370, 2790, 2295, 2625])